[Killed] ObjectLiteral
main/components/Reviews/ReviewsTable.jsx:76:5
       Header: "Comments",
       accessor: "reviewerComments",
     },
-    {
-      Header: "Date Served",
-      accessor: "dateItemServed",
-      Cell: ({ value }) => (
-        <span>{new Date(value).toLocaleDateString("en-US")}</span>
-      ),
-    },
+    {},
     {
       Header: "Dining Commons Code",
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:90:39
   ];
 
   if (userOptions) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, "Reviewstable"));
+    columns.push(ButtonColumn("Edit", "", editCallback, "Reviewstable"));
     columns.push(
       ButtonColumn("Delete", "danger", deleteCallback, "Reviewstable"),
killedBy: ReviewsTable tests Regular user buttons appear and work properly
statusReason: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:98:20
 
   if (moderatorOptions) {
     columns.push(
-      ButtonColumn("Approve", "primary", approveCallback, "Reviewstable"),
+      ButtonColumn("", "primary", approveCallback, "Reviewstable"),
     );
     columns.push(
killedBy: Moderate Page Tests renders reviews with approve/reject buttons for moderator; ReviewsTable tests Moderator buttons appear and work properly
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style
