[Killed] ConditionalExpression
main/components/Nav/AppNavbar.jsx:65:16
                   </NavDropdown>
                 </>
               )}
-              {(hasRole(currentUser, "ROLE_ADMIN") ||
-                hasRole(currentUser, "ROLE_MODERATOR")) && (
-                <NavDropdown
-                  title="Moderate"
-                  id="appnavbar-moderate-dropdown"
-                  data-testid="appnavbar-moderate-dropdown"
-                >
-                  <NavDropdown.Item as={Link} to="/moderate">
-                    Moderator Reviews
-                  </NavDropdown.Item>
-                </NavDropdown>
-              )}
+              {false}
               {currentUser && currentUser.loggedIn ? (
                 <>
killedBy: AppNavbar tests renders correctly for admin user
statusReason: Unable to find an element with the text: Moderate. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <nav
      class="navbar navbar-expand-sm navbar-light bg-warning sticky-top"
      data-testid="AppNavbarLocalhost"
