[Killed] ArithmeticOperator
main/components/MenuItem/MenuItemTable.jsx:27:47
       )
       .map((r) => r.itemsStars);
     if (validRatings.length === 0) return "No ratings";
-    const avg = validRatings.reduce((a, b) => a + b, 0) / validRatings.length;
+    const avg = validRatings.reduce((a, b) => a - b, 0) / validRatings.length;
     return avg.toFixed(1);
   };
killedBy: MenuItemTable Tests calculateAverageRating with single positive rating shows positive result
statusReason: expect(element).not.toHaveTextContent()

Expected element not to have text content:
  -
Received:
  -7.0
