[Killed] BooleanLiteral
main/components/Reviews/ReviewsTable.jsx:17:26
   userOptions,
   moderatorOptions,
 
-  showModerationStatus = false,
+  showModerationStatus = true,
 }) {
   const navigate = useNavigate();
killedBy: ReviewsTable tests does NOT show Moderator Status column by default
statusReason: expect(element).not.toBeInTheDocument()

expected document not to contain element, found <th
  colspan="1"
  data-testid="Reviewstable-header-status"
  role="columnheader"
  style="cursor: pointer;"
  title="Toggle SortBy"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:22:14
   const navigate = useNavigate();
 
   const editCallback = (cell) => {
-    navigate(`/reviews/edit/${cell.row.original.id}`);
+    navigate(``);
   };
 
killedBy: ReviewsTable tests Regular user buttons appear and work properly
statusReason: expected "vi.fn()" to be called with arguments: [ '/reviews/edit/1' ]

Received: 

  1st vi.fn() call:

  [
-   "/reviews/edit/1",

[Killed] ObjectLiteral
main/components/Reviews/ReviewsTable.jsx:61:5
   // Stryker restore all
 
   const columns = [
-    {
-      Header: "Item Id",
-      accessor: "item.id",
-    },
+    {},
     {
       Header: "Item Name",
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: A column ID (or string accessor) is required!

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:80:17
     },
     {
       Header: "Date Served",
-      accessor: "dateItemServed",
+      accessor: "",
       Cell: ({ value }) => (
         <span>{new Date(value).toLocaleDateString("en-US")}</span>
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-dateItemServed"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] StringLiteral
main/components/Reviews/ReviewsTable.jsx:82:51
       Header: "Date Served",
       accessor: "dateItemServed",
       Cell: ({ value }) => (
-        <span>{new Date(value).toLocaleDateString("en-US")}</span>
+        <span>{new Date(value).toLocaleDateString("")}</span>
       ),
     },
killedBy: MyReviewsIndexPage tests renders three reviews correctly for regular user; ReviewsTable tests Has the base column headers and content
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-item.id"]

Ignored nodes: comments, script, style
<body>
  <div />
</body>

Ignored nodes: comments, script, style

[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:91:29
     },
   ];
  
-  if (showModerationStatus) {
-    columns.push({
-      Header: "Moderator Status",
-      accessor: "status",
-      Cell: ({ value }) => value ?? "N/A",
-    });
-  }
+  if (showModerationStatus) {}
 
   if (userOptions) {
killedBy: ReviewsTable tests shows Moderator Status column and value when showModerationStatus is true
statusReason: Unable to find an element with the text: Moderator Status. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"

[Killed] LogicalOperator
main/components/Reviews/ReviewsTable.jsx:95:28
     columns.push({
       Header: "Moderator Status",
       accessor: "status",
-      Cell: ({ value }) => value ?? "N/A",
+      Cell: ({ value }) => value && "N/A",
     });
   }
killedBy: ReviewsTable tests shows Moderator Status column and value when showModerationStatus is true
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  AWAITING_REVIEW
Received:
  N/A

[Killed] BlockStatement
main/components/Reviews/ReviewsTable.jsx:99:20
     });
   }
 
-  if (userOptions) {
-    columns.push(ButtonColumn("Edit", "primary", editCallback, "Reviewstable"));
-    columns.push(
-      ButtonColumn("Delete", "danger", deleteCallback, "Reviewstable"),
-    );
-  }
+  if (userOptions) {}
 
   if (moderatorOptions) {
killedBy: ReviewsTable tests Regular user buttons appear and work properly
statusReason: Unable to find an element by: [data-testid="Reviewstable-cell-row-0-col-Edit-button"]

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
