[Killed] ConditionalExpression
main/components/Reviews/ReviewsTable.jsx:91:7
     },
   ];
  
-  if (showModerationStatus) {
+  if (false) {
     columns.push({
       Header: "Moderator Status",
killedBy: ReviewsTable tests shows Moderator Status column and value when showModerationStatus is true
statusReason: Unable to find an element with the text: Moderator Status. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
