[Killed] BooleanLiteral
src/main/pages/ModerateMenuPage.jsx:14:7
     hasRole(currentUser, "ROLE_ADMIN") ||
     hasRole(currentUser, "ROLE_MODERATOR");
 
-  if (!moderatorOptions) {
+  if (moderatorOptions) {
     return (
       <BasicLayout>
killedBy: ModerateMenuPage Tests shows menu for admin
statusReason: Unable to find an accessible element with the role "button" and name `/moderate reviews/i`

Here are the accessible roles:

  navigation:

  Name "":
  <nav
