[Killed] BlockStatement
src/main/pages/ModerateMenuPage.jsx:14:26
     hasRole(currentUser, "ROLE_ADMIN") ||
     hasRole(currentUser, "ROLE_MODERATOR");
 
-  if (!moderatorOptions) {
-    return (
-      <BasicLayout>
-        <Container className="mt-4">
-          <h2>Access Denied</h2>
-          <p>You do not have permission to access this page.</p>
-        </Container>
-      </BasicLayout>
-    );
-  }
+  if (!moderatorOptions) {}
 
   return (
killedBy: ModerateMenuPage Tests shows Access Denied for regular user
statusReason: Unable to find an element with the text: Access Denied. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >
