[Killed] ObjectLiteral
main/components/Reviews/ReviewsTable.js:83:5
         <span>{new Date(value).toLocaleDateString("en-US")}</span>
       ),
     },
-    {
-      Header: "Dining Commons Code",
-      accessor: "item.diningCommonsCode",
-    },
+    {},
   ];
 
killedBy: ReviewsTable tests Has the base column headers and content
statusReason: Error: A column ID (or string accessor) is required!
