[Killed] ObjectLiteral
main/pages/Reviews/PostReviewPage.js:31:51
 
   const submitReview = async (formData) => {
     try {
-      await axios.post("/api/reviews/post", null, {
-        params: {
-          itemId: id,
-          reviewerComments: formData.reviewerComments,
-          itemsStars: formData.itemsStars,
-          dateItemServed: formData.dateItemServed,
-        },
-      });
+      await axios.post("/api/reviews/post", null, {});
       // Stryker disable next-line all : itemName will be defined
       toast(`Review submitted for ${itemName}`);
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"dateItemServed": "2024-04-01T12:00", "itemId": undefined, "itemsStars": 4, "reviewerComments": "Great!"}
Received: undefined
