[Killed] ObjectLiteral
main/pages/Reviews/ReviewsPage.js:15:5
   } = useBackend(
     // Stryker disable next-line all : don't test internal caching of React Query
     [`/api/reviews/approved/forItem/${itemid}`],
-    { method: "GET", url: `/api/reviews/approved/forItem/${itemid}` },
+    {},
     [],
   );
killedBy: ReviewsPage tests renders empty table when backend is unavailable
statusReason: Error: expect(received).toMatch(expected)

Expected substring: "Error communicating with backend via GET on /api/reviews/approved/forItem/7"
Received string:    "Error communicating with backend via undefined on undefined"
