[Killed] StringLiteral
main/components/AliasApproval/AliasApprovalTable.js:18:40
     },
   ];
 
-  columns.push(ButtonColumn("Approve", "primary", approveCallback, testid));
+  columns.push(ButtonColumn("Approve", "", approveCallback, testid));
   columns.push(ButtonColumn("Reject", "danger", rejectCallback, testid));
 
killedBy: AliasApprovalTable tests buttons appear and work properly
statusReason: Error: expect(element).toHaveClass("btn-primary")

Expected the element to have class:
  btn-primary
Received:
  btn
