[Killed] StringLiteral
main/components/MenuItem/MenuItemTable.js:15:14
 
   const viewCallback = async (_cell) => {
     const itemId = _cell.row.original.id;
-    navigate(`/reviews/${itemId}`);
+    navigate(``);
   };
 
killedBy: MenuItemTable Tests Navigation uses correct menu item id
statusReason: Error: expect(jest.fn()).toHaveBeenCalledWith(...expected)

Expected: "/reviews/42"
Received: ""

Number of calls: 1

Ignored nodes: comments, script, style

[Killed] ConditionalExpression
main/components/MenuItem/MenuItemTable.js:19:48
   };
 
   const calculateAverageRating = (reviews) => {
-    if (!reviews || !Array.isArray(reviews) || reviews.length === 0)
+    if (!reviews || !Array.isArray(reviews) || false)
       return "No reviews";
     const validRatings = reviews
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  No reviews
Received:
  No ratings

[Killed] EqualityOperator
main/components/MenuItem/MenuItemTable.js:23:21
       return "No reviews";
     const validRatings = reviews
       .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
+        (r) => r && typeof r !== "object" && typeof r.itemsStars === "number",
       )
       .map((r) => r.itemsStars);
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: Error: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  No ratings

[Killed] ObjectLiteral
main/components/MenuItem/MenuItemTable.js:32:5
   };
 
   const columns = [
-    {
-      Header: "Item Name",
-      accessor: "name",
-    },
+    {},
     {
       Header: "Station",
killedBy: MenuItemTable Tests Headers appear and empty table renders correctly without buttons
statusReason: Error: A column ID (or string accessor) is required!

[Killed] ObjectLiteral
main/components/MenuItem/MenuItemTable.js:40:5
       Header: "Station",
       accessor: "station",
     },
-    {
-      Header: "Average Rating",
-      accessor: (row) => calculateAverageRating(row.reviews),
-      id: "averageRating",
-    },
+    {},
   ];
 
killedBy: MenuItemTable Tests Headers appear and empty table renders correctly without buttons
statusReason: Error: A column ID (or string accessor) is required!
