[Killed] ArrowFunction
main/components/MyReviews/ReviewForm.js:66:21
           id="review-date"
           type="datetime-local"
           value={dateServed}
-          onChange={(e) => setDateServed(e.target.value)}
+          onChange={() => undefined}
         />
       </Form.Group>
killedBy: MyReviewsCreatePage - full coverage tests submits form and navigates on successful post
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 1
+ Received  + 1

  Object {
-   "dateItemServed": "2024-04-01T12:00",
+   "dateItemServed": "2025-11-07T00:20",
