[Killed] ArithmeticOperator
main/components/Users/UsersTable.js:46:11
         const [year, month, day] = row.dateApproved.split("-");
         const formattedDate = new Date(
           year,
-          month - 1,
+          month + 1,
           day,
         ).toLocaleDateString();
killedBy: UserTable tests Status column appends approval date only for approved users with a valid date
statusReason: TestingLibraryElementError: Unable to find an element with the text: Approved on 10/31/2024. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="tab
