[Killed] BlockStatement
src/main/utils/Reviews.js:18:57
   };
 }
 
-export function cellToAxiosParamsModerate(cell, status) {
-  return {
-    url: "/api/reviews/moderate",
-    method: "PUT",
-    params: {
-      id: cell.row.original.id,
-      status: status,
-      moderatorComments: "",
-    },
-  };
-}
+export function cellToAxiosParamsModerate(cell, status) {}
 
 export function onModerateSuccess() {
killedBy: Reviews cellToAxiosParamsModerate It returns the correct params for APPROVED
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: {"method": "PUT", "params": {"id": 42, "moderatorComments": "", "status": "APPROVED"}, "url": "/api/reviews/moderate"}
Received: undefined

[Killed] ObjectLiteral
src/main/utils/Reviews.js:19:10
 }
 
 export function cellToAxiosParamsModerate(cell, status) {
-  return {
-    url: "/api/reviews/moderate",
-    method: "PUT",
-    params: {
-      id: cell.row.original.id,
-      status: status,
-      moderatorComments: "",
-    },
-  };
+  return {};
 }
 
killedBy: Reviews cellToAxiosParamsModerate It returns the correct params for APPROVED
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Object {
-   "method": "PUT",
-   "params": Object {

[Killed] BlockStatement
src/main/utils/Reviews.js:30:37
   };
 }
 
-export function onModerateSuccess() {
-  console.log("Moderation success");
-}
+export function onModerateSuccess() {}
 
killedBy: Reviews onModerateSuccess It puts the message on console.log and in a toast
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0
