[Killed] ObjectLiteral
main/components/DiningCommons/DiningCommonsTable.jsx:26:5
       // Renders a checkmark box.
       Cell: ({ value }) => (value ? "✅" : "❌"),
     },
-    {
-      Header: "Has Sack Meal",
-      accessor: "hasSackMeal",
-      Cell: ({ value }) => (value ? "✅" : "❌"),
-    },
+    {},
     {
       Header: "Has Takeout Meal",
killedBy: DiningCommonsTable tests Checkmark / X for Boolean columns shows up as expected, url shows up correctly
statusReason: A column ID (or string accessor) is required!
